#+author: Pramudya Arya Wicaksana
#+TITLE: Emacs Config
#+SUBTITLE: My personal Emacs config, used for GO and Flutter development
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+LATEX_CLASS: assignment
#+EMAIL: pram.aryawcksn@protonmail.ch
#+OPTIONS: toc:t

#+BEGIN_ABSTRACT
As a starter kit for myself to dive into EMACS ecosystem
i shall create my own config.

Thus i need to do it myself
#+END_ABSTRACT


** Basic
#+begin_src emacs-lisp
  (setq user-full-name "Pramudya Arya Wicaksana")

  (setq byte-compile-warnings '(cl-functions))
  
    ;; To set the garbage collection threshold to high (100 MB) since LSP client-server communication generates a lot of output/garbage
  (setq gc-cons-threshold 100000000)
  ;; To increase the amount of data Emacs reads from a process
  (setq read-process-output-max (* 1024 1024)) 

        (when (fboundp 'tool-bar-mode)
          (tool-bar-mode -1))
        (when (fboundp 'scroll-bar-mode)
          (scroll-bar-mode -1))
        (when (fboundp 'tool-tip-mode)
          (tool-tip-mode -1))
        (when (fboundp 'menu-bar-mode)
          (menu-bar-mode -1))
        (global-hl-line-mode 1)
        (setq make-backup-file nil
              auto-save-default t)

      (setq split-height-threshold nil)
    (setq split-width-threshold 160)

        ;; Y/N
        (defalias 'yes-or-no-p 'y-or-n-p)

        ;; tabs off
        (setq indent-tabs-mode nil)

        (show-paren-mode t)

        (require 'org-tempo)

        (add-to-list 'org-structure-template-alist '("elc" . "src emacs-lisp"))

        (setq make-backup-files nil)

        (set-face-attribute 'default nil :height 120)
        (display-battery-mode 1)
        (display-time-mode 1)
        (hl-line-mode)

        (global-display-line-numbers-mode 1)
        (setq display-line-numbers-type 'relative)

        (let ((path (shell-command-to-string ". ~/.zshrc; echo -n $PATH")))
          (setenv "PATH" path)
          (setq exec-path 
                (append
                 (split-string-and-unquote path ":")
                 exec-path)))

#+end_src

#+RESULTS:
| /Users/senja/Downloads/google-cloud-sdk/bin | /usr/local/opt/openvpn/sbin | /usr/local/opt/php@7.3/bin | /Users/senja/Downloads/google-cloud-sdk/bin | /usr/local/opt/openvpn/sbin | /usr/local/opt/php@7.3/bin | /Users/senja/Downloads/google-cloud-sdk/bin | /usr/local/bin | /usr/local/go/bin | /opt/X11/bin | /Library/Apple/usr/bin | /Users/senja/go/bin | /usr/bin | /bin | /usr/sbin | /sbin | /usr/local/go/bin | /Users/senja/go/bin | /usr/local/go/bin | /Users/senja/go/bin | /Users/senja/Downloads/google-cloud-sdk/bin | /usr/local/opt/openvpn/sbin | /usr/local/opt/php@7.3/bin | /Users/senja/Downloads/google-cloud-sdk/bin | /usr/local/bin | /usr/local/go/bin | /opt/X11/bin | /Library/Apple/usr/bin | /Users/senja/go/bin | /usr/bin | /bin | /usr/sbin | /sbin | /usr/local/go/bin | /Users/senja/go/bin | /Users/senja/Downloads/google-cloud-sdk/bin | /usr/local/bin | /usr/local/go/bin | /opt/X11/bin | /Library/Apple/usr/bin | /Users/senja/go/bin | /usr/bin | /bin | /usr/sbin | /sbin | /usr/local/Cellar/emacs-plus@28/28.2/libexec/emacs/28.2/x86_64-apple-darwin20.4.0 |

** Dashboard
#+begin_src emacs-lisp
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook))

(setq dashboard-banner-logo-title "Personal Development Environment")
(setq dashboard-startup-banner "~/.emacs.d/hikaru.png" )
(setq dashboard-center-content t)
(setq dashboard-show-shortcuts nil)
(setq dashboard-items '((recents  . 5)
                        (bookmarks . 5)
                        (projects . 5)
                        (agenda . 5)
                        (registers . 5)))
#+end_src

#+RESULTS:
: ((recents . 5) (bookmarks . 5) (projects . 5) (agenda . 5) (registers . 5))

** Org daily habit
#+begin_src emacs-lisp
(setq org-agenda-custom-commands
      '(("h" "Daily habits" 
         ((agenda ""))
         ((org-agenda-show-log t)
          (org-agenda-ndays 7)
          (org-agenda-log-mode-items '(state))
          (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp ":DAILY:"))))
        ;; other commands here
        ))
#+end_src

#+RESULTS:
| h | Daily habits | ((agenda )) | ((org-agenda-show-log t) (org-agenda-ndays 7) (org-agenda-log-mode-items '(state)) (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp :DAILY:))) |

** Auto tangle
#+begin_src emacs-lisp
;; Automatically tangle our Emacs.org config file when we save it
(defun efs/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/config.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src

#+RESULTS:
| nolinum | efs/org-mode-setup | efs/org-mode-visual-fill | org-bullets-mode | (lambda nil (add-hook 'after-save-hook #'efs/org-babel-tangle-config)) | org-tempo-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** Org setup
#+begin_src emacs-lisp
(require 'org-habit)
(add-to-list 'org-modules 'org-habit)

(setq org-todo-keywords
    '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
      (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

(defun efs/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

;; Org Mode Configuration ------------------------------------------------------

(defun efs/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.4)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Fira Code Retina" :weight 'regular :height 180 ))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))


(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

#+RESULTS:
| #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | nolinum | efs/org-mode-setup | efs/org-mode-visual-fill | org-bullets-mode | (lambda nil (add-hook 'after-save-hook #'efs/org-babel-tangle-config)) | org-tempo-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

*** Dart 
#+begin_src emacs-lisp
    (setq package-selected-packages 
      '(dart-mode lsp-mode lsp-dart lsp-treemacs flycheck company
        ;; Optional packages
        lsp-ui company hover))

    (use-package dart-mode)

  ;; export ANDROID_HOME=$HOME/Android
  ;; export PATH=$ANDROID_HOME/cmdline-tools/tools/bin/:$PATH
  ;; export PATH=$ANDROID_HOME/platform-tools/:$PATH

  ;; export PATH="$PATH:$HOME/Android/flutter/bin/"


    (setq lsp-dart-sdk-dir "~/Android/flutter/bin/cache/dart-sdk/")


    (add-hook 'dart-mode-hook 'lsp)

#+end_src

#+RESULTS:
: 1048576

*** Golang
#+begin_src emacs-lisp
  (use-package go-mode
    :ensure t
    :hook
    (
     (go-mode . lsp-deferred)
     (go-mode . company-mode)
     )
    :config
    (setq gofmt-command "gofmt")
    (require 'lsp-go)
    (setq lsp-go-analyses
          '((fieldalignment . t)
            (nilness . t)
            (httpresponse . t)
            (unusedwrite . t)
            (unusedparams . t)
            ))
    )

  (provide 'gopls-config)

  (defun lsp-go-install-save-hooks ()
    (add-hook 'before-save-hook #'lsp-format-buffer t t)
    (add-hook 'before-save-hook #'lsp-organize-imports t t))
  (add-hook 'go-mode-hook #'lsp-go-install-save-hooks)
  (add-hook 'go-mode-hook #'lsp-deferred)
  (add-hook 'go-mode-hook #'yas-minor-mode)
#+end_src

#+RESULTS:
| tree-sitter-hl-mode | flycheck-golangci-lint-setup | yas-minor-mode | lsp-deferred | lsp-go-install-save-hooks | company-mode | lsp-deffered | doom-modeline-env-setup-go |

#+begin_src emacs-lisp
(use-package go-fill-struct :ensure t)
(use-package go-add-tags :ensure t)
(use-package go-gen-test :ensure t)

;; Golang related setup
(rune/leader-keys
  "c"  '(:ignore t :which-key "Code")
  "cg"  '(:ignore t :which-key "Golang")
  "cgg" '(go-add-tags :which-key "Go add tags")
  "cgf" '(go-fill-struct :which-key "Go fill struct")
  "cgt" '(go-gen-test-all :which-key "Go gen tests"))
  
(custom-set-variables '(go-add-tags-style 'lower-camel-case))


#+end_src

#+RESULTS:

#+begin_src emacs-lisp
  (use-package flycheck-golangci-lint
    :hook (go-mode . flycheck-golangci-lint-setup)
    :config
    (setq flycheck-golangci-lint-test t)
    (setq flycheck-golangci-lint-enable-all t)
    (setq flycheck-golangci-lint-disable-linters '("unused" "staticcheck" "misspell"))
    )
#+end_src

#+RESULTS:
| tree-sitter-hl-mode | flycheck-golangci-lint-setup | lsp-go-install-save-hooks | yas-minor-mode | lsp-deferred | doom-modeline-env-setup-go |

#+RESULTS:

**** Rjsx
#+begin_src emacs-lisp
  (use-package rjsx-mode
    :config
    (add-to-list 'auto-mode-alist '("components\\/.*\\.js\\'" . rjsx-mode))
    (add-to-list 'auto-mode-alist '("pages\\/.*\\.js\\'" . rjsx-mode))
    )
  (add-hook 'js-mode-hook #'lsp)
#+end_src

#+RESULTS:
| lsp |

*** Typescript
#+begin_src emacs-lisp
  (use-package typescript-mode
    :ensure t
    :config
    (add-to-list 'auto-mode-alist '("\\.tsx.*$" . typescript-mode)))
  (add-hook 'typescript-mode-hook #'lsp)
#+end_src

#+RESULTS:
| lsp | evil-collection-typescript-mode-set-evil-shift-width |

* Snippet
#+begin_src emacs-lisp
  (use-package company
     :after lsp-mode
     :hook (lsp-mode . company-mode)
     :bind (
            :map company-active-map
            ("<tab>" . company-complete-common-or-cycle)
            ("C-j" . company-select-next-or-abort)
            ("C-k" . company-select-previous-or-abort)
            ("C-l" . company-other-backend)
            ("C-h" . nil)
            )
            (:map lsp-mode-map
            ("<tab>" . company-indent-or-complete-common))
     :custom
     (company-minimum-prefix-length 1)
     (company-idle-delay 0.0)
     :config
     (add-hook 'after-init-hook 'global-company-mode)
     )

   (setq company-backends '((company-capf company-yasnippet)))
#+end_src

#+RESULTS:
| company-capf | company-yasnippet |

#+begin_src emacs-lisp
(use-package yasnippet :ensure t
  :config
  (add-to-list 'yas-snippet-dirs "~/.emacs.d/snippets/yasnippet-golang/")
  (yas-global-mode 1)
  )
#+end_src

#+RESULTS:
: t

** EMMS
#+begin_src emacs-lisp
(use-package emms :ensure t)
(require 'emms-setup)
(emms-all)
(setq emms-player-list '(emms-player-mpv))
(setq emms-source-file-default-directory "~/Music/")
#+end_src

#+RESULTS:
: ~/Music
* Wakatime
#+begin_src emacs-lisp
;;  (use-package wakatime-mode)
  ;; (global-wakatime-mode)
  ;;'(wakatime-api-key "waka_13d2f057-5212-4cc1-8cfa-172eca1f84c2")

#+end_src

#+RESULTS:
| wakatime-api-key | waka_13d2f057-5212-4cc1-8cfa-172eca1f84c2 |

